feed_api/app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

  def create
    @review = Review.new(review_params)

    if @review.save
---
INSERT INTO "reviews" ("customer_name", "content", "date", "created_at", "updated_at", "service_name") VALUES (?, ?, ?, ?, ?, ?)  [["customer_name", "Joe"], ["content", "test\n"], ["date", "5/21/21"], ["created_at", "2021-06-01 10:36:55.023264"], ["updated_at", "2021-06-01 10:36:55.023264"], ["service_name", ""]]

  def destroy
    @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]